import React, { Component } from 'react'
import '../../assets/style/common/protocol.scss';
import Layout from '../../layout/Layout';

type StateType = {
  [propName: string]: any;
};
type PropType = {
  closeCallBack: any;
  [propName: string]: any;
};

interface PrivacyProtocol {
  state: StateType;
  props: PropType;
  uploadRef: any;
}

class PrivacyProtocol extends Component {
  render() {
    return (
      <div className="protocol">
        <Layout title="上工街隐私政策" showTopBar goBack={this.props.closeCallBack}>
          <section id='cash_aggrement_box'>
            <div className="p_head">
              <div className="text1" style={{textAlign: 'right',}}>版本号：202011V1</div>
              <div className="text1" style={{textAlign: 'right',}}>本版本实行日期：2020年11月05日</div>
              <div className="p_txt">尊敬的上工街用户：</div>
              <div className="p_txt">上工街平台（以下简称 “上工街”，包括网站、APP、H5）由本公司深圳市富之富信息科技有限公司（以下简称 “我们”）运营，<strong>我们将通过本政策向您说明在您使用上工街时，我们会如何收集、保存、使用、共享、转让、披露及保护您的个人信息（个人信息的定义及举例可在本政策的最后部分查看），并说明您享有的权利及需承担的义务。本政策适用于我们为您提供的所有相关服务。</strong>如您不同意本政策授权条款的部分或全部，应当停止使用上工街或注销上工街账户。</div>
              <div className="p_txt">本政策将帮助您了解以下内容：</div>
              <div className="p_txt"><strong>1. 我们如何收集、使用您的个人信息</strong></div>
              <div className="p_txt"><strong>2. 我们如何使用 Cookie 和同类技术</strong></div>
              <div className="p_txt"><strong>3. 我们如何共享、转让、披露您的个人信息</strong></div>
              <div className="p_txt"><strong>4. 我们如何保护您的个人信息</strong></div>
              <div className="p_txt"><strong>5. 您的权利</strong></div>
              <div className="p_txt"><strong>6. 关于无民事行为能力人或限制民事行为能力人的个人信息保护</strong></div>
              <div className="p_txt"><strong>7. 本政策如何更新</strong></div>
              <div className="p_txt"><strong>8. 如何联系我们</strong></div>
              <div className="p_txt"><strong>9. 效力和法律适用</strong></div>
              <div className="p_txt">附：个人信息的说明及示例</div>
              <div className="p_txt">
                <p>我们深知个人信息对您的重要性，并会全力保护您的个人信息安全。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、公开透明原则、确保安全原则、主体参与原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。</p>
                <p>您在使用上工街时，我们将按照本政策收集、保存、使用、共享、转让、披露及保护您的个人信息，因此<strong>我们强列建议您认真完整地阅读本政策的所有条款，做出您认为适当的选择。我们努力用通俗易懂、简明扼要的文字表达，并对本政策中与您个人信息及权利义务存在重大关系的内容采用加粗的形式提示您注意，请您重点阅读。一旦您使用或继续使用上工街，即表示您同意我们按照本政策（含更新版本）处理您的个人信息。如对本政策有任何疑问，您可以通过本政策中「如何联系我们」一节提供的联系方式/客服系统与我们联系。</strong></p>
              </div>
            </div>
            <div className="p_txt">
              <h4>1. 我们如何收集、使用您的个人信息</h4>
              <p>在您使用上工街的过程中，我们会遵循合法性、最小化、授权同意的原则收集您的一些信息，用于向您提供服务、提升我们的服务质量、保障您的账户安全以及符合国家法律法规及监管规定的用途。收集的情形包括：</p>
              <p>1.1. 您向我们提供的信息</p>
              <p>1.1.1. 当您在注册上工街账户时，您需要向我们提供手机号码，我们会通过向您提供的手机号码发送验证码的方式进行认证，您需向我们提供该验证码完成注册。如您拒绝提供手机号码及验证码，将导致注册不成功，也无法继续使用我们为您提供的服务，但不影响您查看首页面。您于上工街注册成功后，您还可以根据自身需求及所选择的服务的要求选择进一步完善相关的身份识别信息（如实名认证、头像、昵称等）。</p>
              <p><strong>1.1.2. 如您需发布招聘岗位的，首次发布招聘职位前，您需通过实名认证，您需要提供我们审核所需的个人信息包括真实的姓名、身份证号、性别、年龄以及面部识别信息。同时还需完善您的公司信息包括招聘单位的名称、职位头衔，企业邮箱、工牌及《在职证明》其中的至少一种信息以证明您可以代表该单位进行招聘。如果您提交的单位首次在上工街上发布招聘信息，那么您还需要提供营业执照以验证招聘单位的合法性，认证通过后该职位可正常对外显示。如您拒绝提供，您将无法发布招聘岗位信息。</strong></p>
              <p>1.1.3. 您作为求职者在使用我们服务时，您可能需要向我们提供您的如下个人信息：</p>
              <div className="table_box">
                <table>
                  <tbody>
                    <tr>
                      <th className="text_center">序号</th>
                      <th className="text_center">信息名目</th>
                      <th className="text_center">用 途</th>
                      <th className="text_center">是否必须提供</th>
                      <th className="text_center">不提供的影响</th>
                    </tr>
                    <tr>
                      <th className="text_center">1</th>
                      <th className="text_center">姓名</th>
                      <th className="text_center">确定您本人基本信息</th>
                      <th className="text_center">否</th>
                      <th className="text_center">招聘用户认识偏差</th>
                    </tr>
                    <tr>
                      <th className="text_center">2</th>
                      <th className="text_center">性别</th>
                      <th className="text_center">介绍您自已</th>
                      <th className="text_center">否</th>
                      <th className="text_center">招聘用户认识偏差</th>
                    </tr>
                    <tr>
                      <th className="text_center">3</th>
                      <th className="text_center">手机号码</th>
                      <th className="text_center">与您联系，您接收验证码</th>
                      <th className="text_center">是</th>
                      <th className="text_center">无法注册账户及接收相关信息</th>
                    </tr>
                    <tr>
                      <th className="text_center">4</th>
                      <th className="text_center">电子邮箱</th>
                      <th className="text_center">与您联系</th>
                      <th className="text_center">否</th>
                      <th className="text_center">无法接收相关信息</th>
                    </tr>
                    <tr>
                      <th className="text_center">5</th>
                      <th className="text_center">所在城市</th>
                      <th className="text_center">工作推荐匹配</th>
                      <th className="text_center">否</th>
                      <th className="text_center">工作推荐偏差</th>
                    </tr>
                    <tr>
                      <th className="text_center">6</th>
                      <th className="text_center">教育经历</th>
                      <th className="text_center">介绍您自已</th>
                      <th className="text_center">否</th>
                      <th className="text_center">招聘用户认识偏差</th>
                    </tr>
                    <tr>
                      <th className="text_center">7</th>
                      <th className="text_center">工作经历</th>
                      <th className="text_center">介绍您自已</th>
                      <th className="text_center">否</th>
                      <th className="text_center">招聘用户认识偏差</th>
                    </tr>
                    <tr>
                      <th className="text_center">8</th>
                      <th className="text_center">技能特长</th>
                      <th className="text_center">介绍您自已</th>
                      <th className="text_center">否</th>
                      <th className="text_center">招聘用户认识偏差</th>
                    </tr>
                    <tr>
                      <th className="text_center">9</th>
                      <th className="text_center">工作期望</th>
                      <th className="text_center">您期望的工作情况</th>
                      <th className="text_center">否</th>
                      <th className="text_center">招聘用户认识偏差</th>
                    </tr>
                    <tr>
                      <th className="text_center">10</th>
                      <th className="text_center">其他可选填项</th>
                      <th className="text_center other-th">出生日期、民族、健康状况、婚姻状况、政治面貌、籍贯、入学前户口所在地、毕业时间、身高和体重、在职情况、到岗时间、项目经验、奖励获得、获奖证书、语言能力、培训经历、自我评价、技能爱好、家庭关系</th>
                      <th className="text_center">否</th>
                      <th className="text_center">招聘用户认识偏差</th>
                    </tr>
                  </tbody>
                </table>
              </div>
              <p>注：</p>
              <p>1）工作经历包括开始工作时间、公司名称、担任职务、在职时间段、工作内容描述、获得荣誉等。</p>
              <p>2）教育经历包括毕业学校、学历、在校时间段、在校经历描述、获得荣誉等。</p>
              <p>3）工作期望包括期望城市、期望薪资、期望行业、期望岗位等。</p>
              <p>1.1.4.您需提供自己的真实资料，并保证您的信息（诸如电子邮箱、手机号码等内容）的真实性、有效性、安全性和及时更新，以便我们为您提供服务并与您进行及时、有效的联系。</p>
              <p><strong>1.2.在您使用上工街过程中收集的信息</strong></p>
              <p><strong>1.2.1.为使您使用上工街的服务体验更便捷、顺畅，避免您重复输入或为您展示与您搜索内容相关岗位或求职用户，我们会收集您浏览上工街的痕迹及搜索关键字，如您在何时登录了软件、您的使用频率、您偏好的使用时段等。</strong></p>
              <p><strong>1.2.2.为提高我们软件及服务的适应性、账户的安全性，我们会收集您终端设备的设备型号、设备识别码、操作系统、分辨率信息和浏览器信息。</strong></p>
              <p><strong>1.2.3.我们会收集您使用我们提供的即时通讯服务与其他用户进行通讯所产生的文字、语音、图片、视频等信息，我们会根据法律规定对这些信息进行加密保存，除依法律要求、政府主管部门要求、违法违规信息检测外，不对任何第三人泄露，也不做商业上使用。</strong></p>
              <p>1.2.4.当您使用我们的服务进行简历投递时，我们会收集您的投递记录，方便您能查看投递职位的进展及面试状态等。</p>
              <p>1.2.5.同时，我们还会<strong>经您授权后采集您以下信息</strong>（在首次采集或访问时会单独提示您是否授权），您也可以在上工街内对这些功能进行自主设置取消授权，具体路径为：【我的→设置】。</p>
              <div className="table_box">
                <table>
                  <tbody>
                    <tr>
                      <th className="text_center">序号</th>
                      <th className="text_center">信息名目</th>
                      <th className="text_center">用 途</th>
                      <th className="text_center">拒绝授权的影响</th>
                    </tr>
                    <tr>
                      <th className="text_center">1</th>
                      <th className="text_center">您的位置信息</th>
                      <th className="text_center">您在使用服务时所处位置的地理信息，向推荐附件的岗位或求职者。我们不会追踪您的轨迹</th>
                      <th className="text_center">
                        <div>1）您仅能使用不需要位置信息的求职功能；</div>
                        <div>2）无法提供异常登录检测以防止帐户被盗用；</div>
                        <div>3）无法完成相关的打卡任务但不影响我们为您提供与需要位置信息无关的服务</div>
                      </th>
                    </tr>
                    <tr>
                      <th className="text_center">2</th>
                      <th className="text_center">您设备的拨打电话</th>
                      <th className="text_center">便于您避免手动重复填写我们的客服电话</th>
                      <th className="text_center">不影响我们为您提供服务</th>
                    </tr>
                    <tr>
                      <th className="text_center">3</th>
                      <th className="text_center">访问您设备的相机</th>
                      <th className="text_center">
                        <div>1）实名认证时进行人脸识别或活体检测，我们仅会留存供应商反馈的验证结果，并不收集您的生物特征信息；</div>
                        <div>2）使用上工街的二维码扫描、直接拍摄并上传图片功能</div>
                      </th>
                      <th className="text_center"><strong>无法完成实名制</strong>，但不影响我们为您提供其他不需要实名认证后的服务</th>
                    </tr>
                    <tr>
                      <th className="text_center">4</th>
                      <th className="text_center">您设备的通知权限</th>
                      <th className="text_center">向您的设备发送有关应用信息或通知</th>
                      <th className="text_center">不影响我们为您提供服务</th>
                    </tr>
                    <tr>
                      <th className="text_center">5</th>
                      <th className="text_center">访问您设备的相册</th>
                      <th className="text_center">通过访问您的相册上传您的身份证件照片或其他相关资料</th>
                      <th className="text_center">需要您逐次拍摄相关资料上传，但不影响我们为您提供服务</th>
                    </tr>
                    <tr>
                      <th className="text_center">6</th>
                      <th className="text_center">允许访问、修改或删除您设备的存储器（含SD卡）中的内容（仅适用于安卓操作系统）</th>
                      <th className="text_center">
                        <div>1）使用中会产生必要的应用日志、应用状态记录管理、数据缓存和文件缓存，这些文件将写入您的存储器，并在您下次使用时读取调用。</div>
                        <div>2）可从本地上传图片、照片或文档到上工街；</div>
                        <div>我们不会对您存储器中的其他数据进行读取及修改</div>
                      </th>
                      <th className="text_center">不影响我们为您提供服务</th>
                    </tr>
                    <tr>
                      <th className="text_center">7</th>
                      <th className="text_center">访问通讯录</th>
                      <th className="text_center">邀请手机通讯录好友加入群聊。在此权限下，我们仅会访问您主动选择的联系人信息，不会收集、使用或存储您的通讯录中其他的联系人信息</th>
                      <th className="text_center">不影响我们为您提供服务</th>
                    </tr>
                    <tr>
                      <th className="text_center">8</th>
                      <th className="text_center">访问日历</th>
                      <th className="text_center">提供预约面试等相关功能，通过您的手机日历将面试时间添加至日程安排</th>
                      <th className="text_center">不影响我们为您提供服务</th>
                    </tr>
                    <tr>
                      <th className="text_center">9</th>
                      <th className="text_center">访问麦克风</th>
                      <th className="text_center">您与其他招聘/求职用户进行开聊时发送语音消息或使用语音转文字功能</th>
                      <th className="text_center">只有您主动点击相关图标时，我们才会通过麦克风功能获取语音信息，拒绝授权不影响我们为您提供与语音无关的服务</th>
                    </tr>
                  </tbody>
                </table>
              </div>
              <p>1.3.与第三方相关的信息</p>
              <p>1.3.1.为便于您快速登陆上工街，您可授权我们获得您的微信信息【包括微信openid（用户唯一标识），nickname（用户昵称），sexprovince（用户性别），city（个人信息-省份），country（个人信息-城市），headimgurl（用户头像），privilege（用户特权信息），unionid（用户将公众号绑定到微信开放平台账号后的唯一标识）】，将您的微信账号与您的上工街账号关联。如您拒绝授权，则您无法关联微信账号登陆上工街，但不影响我们为您提供服务。</p>
              <p>1.3.2.在您使用上工街过程中，可能部分服务产品涉及需了解您的在第三方平台的信息，我们会在收集前单独提示您是否授权。如您拒绝，您将无法使用此部分服务。</p>
              <p><strong>1.4.我们如何使用您的个人信息</strong></p>
              <p><strong>1.4.1.个性化服务：我们可能为了提供服务及改进服务质量的合理需要而记录您与我们客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息及您与我们合作伙伴之间互动时我们获得的相关信息等。对于从您的各种设备上收集到的信息，我们可能会将它们进行关联，以便我们能在这些设备上为您提供一致的服务。我们可能会将来自某项服务的信息与来自其他服务的信息结合起来，以便为您提供服务、个性化内容和建议。与个性化服务相关的画像信息将按照本政策与您的个人信息进行同等保护。</strong></p>
              <p><strong>1.4.2.求职/招聘推荐：我们根据您的信息，按一定的推荐算法为您展示合适的招聘信息并将您推荐给合适的招聘用户，或为您展示合适的求职用户，在您授权同意的情况下，我们才会向对方招聘用户或求职用户发送您的信息。您使用我们的服务无论有偿还是无偿，我们无法保证推荐算法的精准度，也无法确保您百分百满意我们的推荐服务，如果您对算法推荐的招聘信息/求职信息与您的期望有任何不符，可通过客服向我们反馈您的宝贵意见。</strong></p>
              <p><strong>1.4.3.联络方式提供：您的手机号、电子邮箱在您没有主动或同意交换的情况下，我们不会展示给其他用户查看。您可以在隐私设置中，设置信息隐藏，隐藏后招聘用户无法浏览您的信息。请注意：如果当您的信息处于隐藏状态，一旦您主动查看职位信息的话，您所查看的职位信息发布者（招聘用户）可看到您隐藏的信息（不包括联系方式）。</strong></p>
              <p><strong>1.4.4.提供客户服务及进行投诉处理：我们的客服系统会使用您的信息。为保证您的帐户安全，我们的客服会使用您的信息与您核验您的身份。为了保证您及他人的合法权益，如您被他人投诉或投诉他人，我们会将您的姓名及有效证件号码、联系方式、投诉相关的内容提供给消费者权益保护部门及监管机构，以便及时解决投诉纠纷，但法律法规明确禁止提供的除外。</strong></p>
              <p><strong>1.4.5.支付功能、交付功能：如我们的服务中涉及付费增值服务时，您可以选择与我们合作的资金方以受托支付的方式向我们支付交易款项，也可以选择第三方支付机构（如微信、支付宝、银联等）向我们支付交易款项，您同意我们将您的订单信息及交易款项金额与这些机构共享以实现您的支付。我们不会收集您的支付信息，但会收集您的购买明细、订单号与交易金额信息，并与支付机构共享以实现其确认您的支付指令并完成支付。如付费增值服务涉及交货的，我们会将您的订单信息、收件人、收件地址、联络电话等信息与第三方快递、物流公司共享，以完成您订购货品的运送及交付。</strong></p>
              <p><strong>1.5.为了保障您的账户和资金安全，在您进行一些重要操作时（例如换设备登录、找回密码、挂失账户、冻结账户、注销帐户等），我们需要验证您本人的身份及这些重要操作是您本人的真实意愿，为此您需要授权我们调用您设备的像机、麦克风对您的身份的证明资料（例如：身份证照片、手持身份证照片、脸部图像或视频，您可根据相关页面或客服人员的提示提供您的证明资料）进行收集，我们会传送给供应商核验；我们仅收集供应商反馈的验证结果，并不收集您的生物特征信息，同时我们会要求供应商对您的信息严格保密，且须采取足够措施保护您的信息安全。如您不同意提供前述信息，您将无法完成特定操作，但不影响您使用我们提供的其他服务。</strong></p>
              <p><strong>1.6.如您选择使用我们提供的其他服务，基于该服务我们需要收集您的信息时，我们会另行向您说明信息收集的范围与目的，并征得您的同意。</strong>我们会按照本政策、用户注册协议以及相应的授权协议约定收集、保存、使用、共享、披露及保护您的信息；如您不提供前述信息，您可能无法使用某项或某部分服务，但不影响您使用我们提供的其他服务。</p>
              <p>1.7.当您通过上工街使用我们合作伙伴产品及/或服务时，您授权我们可向合作伙伴提供我们所收集的与您相关的，且与使用我们合作伙伴产品及/或服务相关的个人信息。我们会在您开通我们合作伙伴提供的产品及/或服务时向您明示并征求您的授权，如您拒绝授权，将会导致无法使用我们合作伙伴提供的产品及/或服务。</p>
              <p>1.8.当您通过我们合作伙伴的网络平台使用上工街，或当您通过上工街使用我们合作伙伴产品及/或服务，且与我们合作伙伴进行互动时，您授权我们可从合作伙伴处接收关于您的体验或您与其互动的信息。如您拒绝授权，我们及合作伙伴将无法为您改进服务质量。</p>
            </div>
            <div className="p_txt">
              <h4>2. 我们如何使用 Cookie 和同类技术</h4>
              <p>2.1.Cookie</p>
              <p>2.1.1.为帮您省去访问、使用上工街时重复输入注册信息的步骤，提升我们的服务质量，或者帮助判断您的账户安全状态，我们会在您的移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。</p>
              <p>2.1.2.我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。您可以清除移动设备上保存的所有 Cookie。您可通过上工街内的若干设定，控制我们收集所得的信息。例如，通过上工街的【我的 → 设置 → 清除缓存】清除您的浏览记录。但如果您这么做，则需要在每一次访问上工街时亲自更改用户设置，而且您之前所记录的相关信息也均会被清除。</p>
            </div>
            <div className="p_txt">
              <h4>3.我们如何共享、转让、披露您的个人信息</h4>
              <p>3.1.共享：</p>
              <p><strong>我们对您的个人信息承担保密义务，除法律法规及监管部门另有规定外，我们仅在以下情形中与第三方共享您的个人信息，第三方包括我们的关联公司、其他合作伙伴：</strong></p>
              <p>3.1.1.<strong>第三方服务提供者</strong>。我们可能会聘请其他公司、组织或个人代表我们履行某些职能，包括但不限于发送信函、电子邮件、手机短信、手机消息通知栏信息、提供市场营销帮助、提供搜索结果和链接（包括付费搜索名单和链接）、数据分析处理、会计服务以及法律服务等。第三方服务提供者能够接触到为履行其职责所需的信息，但不能将此信息用于其他任何其他目的；我们将要求第三方对您的信息采取保护措施并且严格遵守相关法律法规与监管要求。</p>
              <p>3.1.2.<strong>业务转让</strong>。为健康、持续发展我们的业务，我们可能会出售部分业务，在这些交易中，客户信息通常是所转让业务资产中的一部分，与该等业务一并转让给受让方，但这些信息仍然受制于转让前已有的任何隐私声明所作出的承诺，但您作出其他同意的除外。</p>
              <p>3.1.3.<strong>业务合作</strong>。为顺利地向您提供产品或服务及相关增值服务之必要，当您通过我们合作伙伴的渠道接受我们提供的产品或服务，您同意我们可以将您必要的个人信息分享给我们的合作伙伴；<strong>当您通过上工街接受我们合作伙伴提供的产品或服务，您授权我们</strong>可向合作伙伴提供我们所收集的与您相关的，且与使用合作伙伴产品及/或服务相关的个人信息，同时您授权<strong>合作伙伴也可以将您必要的个人信息及信贷信息提供给我们</strong>。无论是您通过我们合作伙伴的渠道接受我们提供的产品或服务，还是您通过上工街接受合作伙伴提供的产品或服务，我们承诺将严格要求合作伙伴对您的个人信息承担保密义务。如您拒绝授权，将会导致无法使用相应的产品或服务，但不影响您使用我们提供的其他服务。</p>
              <p>3.2.转让</p>
              <p><strong>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</strong></p>
              <p>3.2.1.在获取您明确同意的情况下向其他方转让您的个人信息；</p>
              <p>3.2.2.在涉及合并、兼并、收购、重组时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，并采取相应有效措施，否则我们将要求该公司、组织重新向您征求授权同意。</p>
              <p>3.3.披露</p>
              <p>当我们要将您的人个信息用于本政策未载明的其它用途时，会事先征求您的同意；当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。<strong>但根据国家相关法律法规，在以下情形中，我们会依法收集、使用、披露您的个人信息且不会另行征得您的授权同意：</strong></p>
              <p><strong>3.3.1.与您履行法律法规规定的义务相关的；</strong></p>
              <p><strong>3.3.2.与国家安全、国防安全直接相关的；</strong></p>
              <p><strong>3.3.3.与公共安全、公共卫生、重大公共利益直接相关的；</strong></p>
              <p><strong>3.3.4.与犯罪侦查、起诉、审判和判决执行等直接相关的；</strong></p>
              <p><strong>3.3.5.出于维护您或他人的生命、财产等重大合法权益但又很难得到您本人同意的；</strong></p>
              <p><strong>3.3.6.所收集的个人信息是您自行向社会公众公开的；</strong></p>
              <p><strong>从合法公开披露的信息中收集的个人信息，例如：合法的新闻报道、政府信息公开等渠道</strong></p>
              <p><strong>3.3.8.根据您的要求签订和履行合同所必需的；</strong></p>
              <p><strong>3.3.9.法律法规规定的其他情形。</strong></p>
            </div>
            <div className="p_txt">
              <h4>4.我们如何保护您的个人信息</h4>
              <p>4.1.目前，<strong>我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。</strong>例如：</p>
              <p>4.1.1.在您的移动终端与上工街之间交换数据时受 SSL 加密保护；</p>
              <p>4.1.2.我们会使用加密技术确保数据的保密性；</p>
              <p>4.1.3.我们会使用受信赖的保护机制防止数据遭到恶意攻击；</p>
              <p>4.1.4.我们通过建立数据分类分级、数据安全管理规范、安全开发规范来规范个人信息的储存、访问；</p>
              <p>4.1.5.我们会部署严格的数据访问控制机制及建立数据访问日志机制，确保只有被授权人员才可访问您的个人信息；</p>
              <p>4.1.6.我们会设置内部审批流程，非特别被授权人员不可对个人信息进行重要操作（如批量修改、拷贝、下载等）；</p>
              <p>4.1.7.我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。</p>
              <p>4.2.我们会聘请外部独立第三方机构定期对上工街的信息安全管理体系进行评估。</p>
              <p>4.3.我们会采取一切合理可行的措施，确保不收集无关的个人信息。</p>
              <p><strong>4.4.您在上工街中与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息，以免泄密。</strong></p>
              <p>4.5.互联网环境并非百分之百安全，我们将尽力确保您在上工街中发送信息的安全性。如果上工街的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。</p>
              <p>4.6.为应对个人信息泄露、损毁、丢失等可能出现的风险，我们制定了多项制度，明确安全事件、安全漏洞的分类分级标准及相应的处理流程。我们为安全事件建立了专门的应急响应团队，按照安全事件处置规范要求，针对不同安全事件启动安全预案，进行止损、分析、定位、补求。在不幸发生个人信息安全事件后，我们将按照法律法规的要求，通过电子邮件、电话、上工街公告及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。难以逐一告知个人信息主体时，我们会采取合理、有效的方式在上工街中发布公告。同时，上工街还将按照监管部门要求，主动上报个人信息安全事件的处置情况。</p>
              <p>4.7.您上工街中的各类密码设置请使用复杂密码，以便您上工街账号得到更高级别的安全保护。<strong>请您务必妥善保管好您在上工街的用户名、密码及其他身份要素，密码是识别您身份非常非常重要的要素。您在使用上工街提供的服务时，我们会通过您的用户名、密码要素来识别您的身份。一旦您泄漏了前述信息，您极大可能会蒙受损失，并可能产生对您不利的法律后果，我们不会对此承担责任。如您发现前述信息可能或已经泄露时，请您立即和我们取得联系，以便我们及时采取相应措施以避免或降低相关损失。</strong></p>
              <p>4.8.在您终止使用上工街的服务后，我们会停止对您的信息的收集和使用，法律法规或监管部门另有规定的除外。如上工街停止运营，我们将及时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并按法律法规或监管部门规定对所持有的您的个人信息进行处理。</p>
              <p>4.9.您的个人信息存储于中华人民共和国境内的服务器中，未经您的授权及法律法规要求，我们不会将您的个人信息存储于中华人民共和国境外的服务器。</p>
              <p>4.10.我们对于您个人信息的存储期限将依据法律法规、行业监管政策、实现业务目的最短时间等原则确定，一般为五年。除非法律法规要求或政府监管部门要求外，存储期限届满后我们将对您个人信息进行删除或匿名化处理。请您了解并同意，我们有权对匿名化处理的数据进行分析并予以商业化的利用。</p>
            </div>
            <div className="p_txt">
              <h4>5.您的权利</h4>
              <p>按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：</p>
              <p>5.1.您可以通过上工街【我的→设置】来查询、修改及删除您使用上工街时您提供的个人信息。如果您对如何查询、修改及删除您的个人信息有疑问的，请您及时向我们咨询。</p>
              <p><strong>5.2.我们在提供服务的过程中，您可以通过删除信息、关闭设备功能、在上工街【我的→设置】中进行隐私设置等方式改变部分您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销上工街帐号来撤回我们收集您个人信息的全部授权。</strong></p>
              <p>5.3.如果您需要注销您的上工街账户，您可以联系我们。如您符合约定的账户注销条件，我们将为您注销帐号。如您不符合注销条件（如您在上工街尚有未结清业务），您可联系相应的客服热线或通过在线客服获得解决方案。<strong>在您注销账户后，我们将停止为您提供服务，并按法律法规或监管部门规定对所持有的您的个人信息进行处理。</strong></p>
              <p>5.4.您有权获取您的个人信息副本，您可以通过客服热线或在线客服联系我们，我们将在15日内对您的请求进行处理。如您发现我们所保存的您的个人信息有错误或不完整的，您可与我们联系修正或补充。</p>
              <p>5.5.如果您认为我们存在违反法律、行政法规的规定或者与您的约定收集、使用您个人信息的，您可以与我们联系提出申诉。</p>
              <p>5.6.如您认为我们的决定影响到您的合法权益时，您可通过客服热线或在线客服向我们提出申诉，我们将在15日内对您的申诉进行处理。</p>
              <p>5.7.如您发现我们所保存的您的个人信息有错误或不完整的，您可与我们联系修正或补充。</p>
              <p><strong>5.8.为保障安全，我们可能会先要求您验证自己的身份，然后再处理您的请求。您可能需要提供书面请求，或以其他方式证明您的身份。对于您的请求，我们原则上将于15日内做出答复。</strong></p>
              <p>5.9.对于您合理的请求，我们原则上不收取费用，<strong>但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份服务器上存放的信息）的请求，我们可能会予以拒绝。</strong></p>
              <p><strong>5.10.在以下情形中，按照法律法规要求，我们将无法响应您的请求：</strong></p>
              <p><strong>5.10.1.与国家安全、国防安全直接相关的；</strong></p>
              <p><strong>5.10.2.与公共安全、公共卫生、重大公共利益直接相关的；</strong></p>
              <p><strong>5.10.3.与犯罪侦查、起诉、审判和判决执行等直接相关的；</strong></p>
              <p><strong>5.10.4.我们有充分证据表明您存在主观恶意或滥用权利的；</strong></p>
              <p><strong>5.10.5.响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。</strong></p>
              <p><strong>5.10.6.涉及商业秘密的。</strong></p>
            </div>
            <div className="p_txt">
              <h4>6.关于无民事行为能力人或限制民事行为能力人的个人信息保护</h4>
              <p><strong>6.1.我们的服务主要面向具备完全民事行为能力的自然人。如果没有父母或监护人的同意，无民事行为能力人或限制民事行为能力人不得创建自己的用户账户。</strong></p>
              <p>6.2.对于经父母同意而收集儿童（未满14周岁的未成年人）个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。</p>
            </div>
            <div className="p_txt">
              <h4>7.本政策如何更新</h4>
              <p><strong>7.1.我们会根据法律法规的要求或业务运营的需要，对本政策不时进行修改。</strong></p>
              <p>7.2.通常情况下，我们不会削减你按照本隐私政策所应享有的权利。我们会在上工街上发布或者以电子邮件、电话或其他方式通知你对本政策所做的任何变更，<strong>对于重大变更，视具体情况我们可能还会提供更为显著的通知</strong>。在此情况下，若你选择继续使用上工街的服务，即表示同意接受经修订的本政策的约束。</p>
              <p>7.3.本政策所指的重大变更包括但不限于：</p>
              <p>7.3.1.收集、保存、使用、共享、披露及保护您的个人信息的范围、目的、规则发生变化；</p>
              <p>7.3.2.我们在所有权结构、组织架构等方面发生重大变化，如业务调整、破产并购等引起的所有者变更等。</p>
              <p>7.3.3.个人信息共享、转让或公开披露的主要对象发生变化。</p>
              <p>7.3.4.你参与个人信息处理方面的权利及其行使方式发生重大变化。</p>
              <p>7.3.5.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时。</p>
              <p>7.3.6.个人信息安全影响评估报告表明存在高风险时。</p>
            </div>
            <div className="p_txt">
              <h4>8.如何联系我们</h4>
              <p>8.1.如果您对本隐私政策有任何疑问、意见或建议，通过客服热线400-930-3606与我们联系。</p>
              <p>8.1.1.深圳市富之富信息科技有限公司有限公司的注册地址：广东省深圳市龙华区龙华街道富康社区东环二路2号富士康工业园C12栋5层；</p>
              <p>8.1.2.个人信息保护负责人联系邮箱：GRXXBH@fujfu.com</p>
              <p>8.2.一般情况下，我们将在15天内回复您。如您对我们的回复不满意，或认为我们个人信息处理行为损害了您的合法权益，您可以向相关主管部门进行投诉。</p>
            </div>
            <div className="p_txt">
              <h4>9.效力和法律适用</h4>
              <p>9.1.本政策自您点击确认之日起生效，在您使用上工街相关服务期间持续有效。</p>
              <p>9.2.本政策的适用中华人民共和国法律进行解释。</p>
              <p>9.3.上工街将会竭尽全力为您提供满意、便捷的服务，若您与上工街之间产生的争议而无法通过协商的方式解决时，你应向深圳市富之富信息科技有限公司所在地有管辖权人民法院提起诉讼解决。</p>
              <p>附：个人信息的说明及示例</p>
              <p>注意：此处示例为依据《中华人民共和国网络安全法》所做的举例，并非我们收集的罗例。</p>
              <p>根据《中华人民共和国网络安全法》，个人信息是指“以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息，包括但不限于自然人的姓名、出生日期、身份证件号码、个人生物识别信息、住址、电话号码等”。</p>
              <div className="table_box">
                <table>
                  <tbody>
                    <tr>
                      <th className="text_center th_left"></th>
                      <th className="text_center">个人信息举例<strong>（加粗字及标下划线字为“个人敏感信息”）</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center">个人基本资料</th>
                      <th className="text_center">姓名、生日 、性别、婚姻状况、民族、国籍、家庭关系、住址、<strong className="strong_underline">个人电话号码</strong>、电子邮箱等</th>
                    </tr>
                    <tr>
                      <th className="text_center"><strong>个人身份信息</strong></th>
                      <th className="text_center"><strong className="strong_underline">身份证、军官证、护照、驾驶证、工作证、出入证、社保卡、居住证等</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center"><strong>个人生物识别信息</strong></th>
                      <th className="text_center"><strong className="strong_underline">个人基因、指纹、声纹、耳廓、虹膜、面部特征等</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center"><strong>网络身份标识信息</strong></th>
                      <th className="text_center"><strong className="strong_underline">系统帐号、IP地址、邮箱地址及与前述有关的密码、口令、口令保护答案、用户个人数字证书等</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center"><strong>个人健康生理信息</strong></th>
                      <th className="text_center"><strong className="strong_underline">个人因生病医治等产生的相关记录、如病症、住院志、医嘱单、检验报告、手术及麻醉记录、护理记录、用药记录、药物食物过敏信息、生育信息、以往病史、诊治情况、家族病史、现病史、传染病史等，以及与个人身体健康状况产生的相关信息，及体重、身高、肺活量等</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center">个人教育工作信息</th>
                      <th className="text_center">个人职业、职位、工作单位、学历、学位、教育经历、工作经历、培训记录、成绩单等</th>
                    </tr>
                    <tr>
                      <th className="text_center"><strong>个人财产信息</strong></th>
                      <th className="text_center"><strong className="strong_underline">银行帐号、鉴别信息（口令）、存款信息（包括资金数量、支付收款记录等）、房产信息、信贷记录、征信信息、交易和消费记录、流水记录等，以及虚拟货币、虚拟交易、游戏类兑换码等虚拟财产信息</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center"><strong>个人通信信息</strong></th>
                      <th className="text_center"><strong className="strong_underline">通信记录和内容、短信、彩信、电子邮件，以及描述个人通信的数据（通常称为元数据）等</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center">联系人信息</th>
                      <th className="text_center"><strong className="strong_underline">通讯录</strong>、好友例表、群列表、电子邮件地址列表等</th>
                    </tr>
                    <tr>
                      <th className="text_center"><strong>个人上网记录</strong></th>
                      <th className="text_center"><strong className="strong_underline">指通过日志储存的用户操作记录，包括网站浏览记录、软件使用记录、点击记录等</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center">个人常用设备信息</th>
                      <th className="text_center">指包括硬件序列号、设备MAC地址、操作系统类型、软件列表、唯一设备识别码（如IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等）等在内的描述个人常用设备基本情况的信息</th>
                    </tr>
                    <tr>
                      <th className="text_center">个人位置信息</th>
                      <th className="text_center"><strong className="strong_underline">包括行踪轨迹、精准定位信息、住宿信息、经纬度等</strong></th>
                    </tr>
                    <tr>
                      <th className="text_center"><strong>其他信息</strong></th>
                      <th className="text_center"><strong className="strong_underline">婚史、宗教信仰、性取向、未公开的违法犯罪记录等</strong></th>
                    </tr>
                  </tbody>
                </table>
              </div>
              <p>个人敏感信息指“个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。通常情况下，14岁以下（含）儿童的个人信息和自然人的隐私信息属于个人敏感信息”。</p>
            </div>
          </section>
        </Layout>
      </div>
    )
  }
}

export default PrivacyProtocol;
