import React, { Component } from "react";
import "../../assets/style/common/protocol.scss";
import Layout from "../../layout/Layout";

type StateType = {
  [propName: string]: any;
};
type PropType = {
  closeCallBack: any;
  [propName: string]: any;
};

interface RegisterProtocol {
  state: StateType;
  props: PropType;
  uploadRef: any;
}

class RegisterProtocol extends Component {
  render() {
    return (
      <div className="protocol">
        <Layout title="用户注册协议" showTopBar goBack={this.props.closeCallBack}>
          <section id="cash_aggrement_box">
            <div className="p_head">
              <div className="text1">【审慎阅读】：</div>
              <p>尊敬的客户，欢迎您光临富士康科技集团旗下劳务用工平台——“上工街”。为了您能便利、快捷的尊享我们提供的产品与服务，您需与我们签署本协议。您在点击同意注册之前，请务必审慎阅读、充分理解本协议中相关条款内容，其中包括：您的授权条款、与您约定免除或限制责任的条款、与您个人信息相关（包括定义、收集、存储、加工、披露等）的条款、与您约定法律适用和管辖的条款、其他以粗体下划线标识的重要条款。</p>
              <div className="text1 mt">【特别提示】</div>
              <p className="bold-underline">当您按照注册页面提示填写信息、查看本协议内容后，您在点击“同意”或“注册”或显示类似字眼的页面时，即表示您已充分阅读、理解并接受本协议的全部内容；若您注册成为上工街用户，则表示您对本协议的全部内容已充分阅读并认可和同意遵守。</p>
              <p>您须遵守中国法律、法规、规章及其他政府规范性文件规定，如有违反而造成任何法律后果，您将独立承担所有相应的法律责任；同时，我们有权立即中止或终止为您服务。</p>
              <p>
                <span className="bold-underline">阅读本协议的过程中，如果您不同意本协议中任何条款约定，您应立即停止注册程序。</span>如您对协议内容有疑问，您可于工作时间致电客服热线4009303606咨询。
              </p>
            </div>
            <div className="mt">
              <p>
                深圳市富之富信息科技有限公司（本协议中简称“本公司”或“我们”)及运营的“上工街”平台（本协议中简称“上工街”）依据本协议的约定为上工街用户(本协议中简称“用户”或“您”)提供服务。本协议在用户和本公司之间具有合同上的法律效力，适用于用户在上工街的全部活动。本协议内容包括本协议全部条款及上工街已经发布的或将来可能发布的各类规则、通告。所有规则、通告为本协议不可分割的一部分,与本协议具有同等法律效力。上工街有权根据运营需要不定时地制定、修改本协议或各
                类规则，上工街将随时刊载并公告本协议及规则变更情况。经修订的协议、规则一经公布，立即自动生效。对于协议、规则生效之前注册的用户，若用户在新规则生效后继续使用上工街供的各项服务，则表明用户已充分阅读并认可和同意遵守新的协议或规则。若用户拒绝接受新的协议和规则，用户应立即放弃或终止继续使用上工街提供的各项服务，但该用户应承担在上工街已经进行的交易下所应承担的任何法律责任，且应遵循该用户发生交易时有效的协议或规则内容。
              </p>
            </div>
            <div className="p_txt">
              <h5>一、用户</h5>
              <p>1.1 上工街客户必须为中华人民共和国法律规定的年满18周岁以上的，或法律规定满足其他条件的，或具有合法用工主体资质的，具有完全民事权利和民事行为能力且能够独立承担民事责任的自然人、法人、或组织，在注册之日以及此后使用上工街服务期间必须以招聘和/或求职为目的。如用户不符合此条件的，请勿注册。若违反前述规定注册使用上工街服务，本公司有权中止或终止用户资格、追究用户相关法律责任，且由此而引发的损失和后果应由用户自行承担。</p>
              <p>
                1.2 在注册成为上工街用户后，用户应按照上工街提示的内容完善身份信息，如真实姓名、职业、工作经历、手机号码等；如用户为招聘主体的，应保证及时更新本人提供的“单位名称、职务或岗位信息、企业邮箱”等相关授权信息及材料，并确保前述授权的真实性；用户应保证其职务行为，包括但不限于发布招聘信息、与求职者沟通等均在使用上工街期间持续有效；通过认证的用户应保持其招聘帐号与对应的授权单位具有唯一性。上工街部分服务需要用户实名认证的，用户应按照上工街
                提示的内容完善身份信息以达到实名认证的要求，否则此部分功能会无法使用。实名认证需要用户按照上工街提示输入本人的姓名、身份证号码等信息，或者包括但不限于被允许的其他方式，例如通过验证银行卡信息、手机验证码或其他生物特征等识别方式，完成实名认证。
              </p>
              <p>1.3 若用户提供任何错误、不实或不完整的资料，或我们有理由怀疑资料为错误、不实或不完整及违反本协议的，或用户资料、言行等有悖于上工街做为招聘平台综旨的，或违反职位信息发布规则的，我们有权修改用户的注册昵称、个人说明、发布的信息等，中止或终止该用户使用其帐号，中止或终止提供全部或部分服务。</p>
              <p>1.4 若用户故意提供虚假的身份信息、公司信息进行注册，发布虚假招聘信息或者求职信息的，视为严重违反本协议，我们有权暂停或终止该用户账号并停止提供服务。虚假注册、发布虚假信息给我们造成的经济、名誉等任何损失，我们将追究该用户的法律责任。</p>
              <p>1.5 用户须理解并同意，上工街仅为用户提供招聘信息分享、传播及获取招聘、求职机会的平台，您必须为自己的注册、认证账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。关于用户通过上工街上传、发布信息的具体规则，应阅读并遵守职位信息发布规则。</p>
            </div>
            <div className="mt p_txt">
              <h5>二、用户的权利义务</h5>
              <p>2.1 用户在注册使用上工街服务时按要求提供真实、最新、有效及完整的资料，并且授予上工街基于提供产品服务的目的，对用户提供的资料及数据信息拥有无偿的使用权利。同时，用户有义务维持并更新注册的资料，确保其为真实、最新、有效及完整的资料。如因用户未及时更新基本资料，导致上工街服务无法提供或提供时发生任何错误，用户不得将此作为取消交易或承担义务的理由，上工街亦不承担任何责任，所有后果应由用户自行承担。</p>
              <p>2.2 用户提供任何错误、虚假、过时或不完整的资料，或者本公司依其独立判断怀疑资料为错误、虚假、过时或不完整的，本公司有权中止或终止用户在上工街的注册，并拒绝用户使用上工街服务的部分或全部功能。在此情况下，本公司不承担任何责任，用户同意承担因此所产生的直接或间接的任何支出或损失。如因此而给本公司及上工街造成损失的，用户还应予以赔偿。</p>
              <p>2.3 成功注册成为上工街用户后，用户应当妥善保管自己的用户名、密码、手势等信息，并不得将用户名转让、赠与或授权给第三方使用。用户在此同意并确认，使用其用户名、密码、手势登录上工街及在上工街的用户账户下发出的一切指令均视为用户本人的行为和意思表示，该等指令一经做出即不可逆转，由此而产生的一切责任和后果均应由用户本人承担，本公司不承担任何责任。</p>
              <p>2.4 用户承诺合法使用上工街的服务及内容，禁止在上工街上从事任何可能违反中国现行的法律、法规、规章和规范性文件的行为以及本协议约定的违约行为，禁止从事下列制作、复制、发布、传播违反国家相关法律法规及七条底线、九不准管理规定的违法和不良信息的行为。用户如有违反而导致任何法律后果的发生，用户将以自己的名义独立承担所有相应的法律责任。</p>
              <p> 1）反对宪法所确定的基本原则的；</p>
              <p> 2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
              <p> 3）损害国家荣誉和利益，煽动民族仇恨、民族歧视、破坏民族团结的；</p>
              <p> 4）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
              <p> 5）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
              <p> 6）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
              <p> 7）侮辱或者诽谤他人，侵害他人合法权利的；</p>
              <p> 8）含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或有悖道德、令人反感的内容的；</p>
              <p> 9）含有中国法律、法规、规章、条例以及任何具有法律效力的规范所限制或禁止的其它内容的；</p>
              <p> 10）使用上工街服务的过程中，以任何方式危害求职者合法权益的；</p>
              <p> 11）冒充任何人或机构，包含但不限于冒充上工街工作人员或以虚伪不实的方式陈述或谎称与任何人或机构有关的；</p>
              <p> 12）发布、传播侵犯任何人的肖像权、名誉权、隐私权、专权、商标权、著作权、商业秘密的信息或言论的；</p>
              <p> 13）将病毒或其它计算机代码、档案和程序，加以上载、张贴、发送电子邮件或以其它方式传送的；</p>
              <p> 14）跟踪或以其它方式骚扰其他用户的；</p>
              <p> 15）未经合法授权而截获、篡改、收集、储存或删除他人个人信息、电子邮件或其它数据资料，或将获知的此类资料用于任何非法或不正当目的；</p>
              <p> 16）以任何方式干扰或企图干扰上工街的任何产品、任何部分或功能的正常运行，或者制作、发布、传播上述工具、方法等；</p>
              <p> 17）未能按照上工街的流程、规则进行注册、认证或使用本服务的，违反本服务功能限制或运营策略，或采取任何措施规避前述流程、规则、限制或策略的；</p>
              <p> 18）未经我们的许可使用插件、外挂或通过其他第三方工具、运营平台或任何服务接入本服务和相关系统的；</p>
              <p> 19）利用上工街账号或上工街服务从事，包括但不限于欺诈、传销、刷流量、好评、违法物品营销等任何违法兼职或犯罪活动的；</p>
              <p> 20）仿冒、混淆他人账号昵称、头像、功能介绍或发布招聘内容等，或冒充、利用他人名义对外招聘的；</p>
              <p> 21）为任何注册用户或非注册用户提供自动登录到上工街、代办或协助他人代办身份认证服务的或代售身份认证所需的相关材料或凭据等；</p>
              <p> 22）未经我们授权，以任何目的自行或授权、允许、协助任何第三人采用任何技术手段【包括但不限于“蜘蛛”(spider)程序、爬虫程序、拟人程序等非真实用户或避开、破坏技术措施等非正常浏览的手段、方式，读取、复制、转存、获得数据和信息内容的行为】收集上工街的信息；</p>
              <p> 23）其他任何导致或可能导致我们与第三方产生纠纷、争议或诉讼的行为。</p>
              <p>2.5 上工街有权对用户使用上工街服务的情况进行审查和监督，如用户在使用上工街服务时违反本协议约定或法律规定，上工街有权要求用户改正、澄清，直至单方面采取必要措施以消除或减轻用户不当行为给上工街、第三方、互联网服务或社会公共利益造成的任何影响。</p>
              <p>2.6 用户在使用上工街各项服务的同时，同意我们通过拨打电话、发送短信、发送电子邮件、上工街站内信等方式向用户发布、推送、提供的各类广告信息、促销优惠信息，以及邀请用户参与版本测试、用户体验反馈、回访等活动。</p>
              <p>2.7 用户有权向上工街查询其信息的权利，有权要求上工街更正、补充其信息的权利，用户也有权要求注销上工街账户的权利，账户注销后，我们会根据法律规定对用户信息做删除或匿名化处理。</p>
              <p>2.8 用户同意，如我们发现用户服务于存在猎头业务、存在人力资源外包业务、存在劳务派遣业务的经营主体时，我们有权立即中止或终止为您提服务，并关闭您的上工街账户。</p>
              <p>2.9 用户不得通过使用上工街的服务向其他用户收费。</p>
            </div>
            <div className="mt">
              <h5>三、服务内容及收费</h5>
              <p>上工街通过互联网为用户提供的服务包括但不限于：求职推荐、职位发布、即时通讯、线上商城、贷款推荐、广告发布等，具体详情以上工街当时提供的服务内容为准。用户应自行配备接入网络所必需的设备，包括计算机、手机或其它存取装置，并自行承担接入网络及使用网络所需要的费用。</p>
              <div className="p_txt">
                <p>3.1 求职推荐：为了提高您的求职成功率，我们会将您的简历放入我们的数据库，经过上工街认证的招聘用户可通过我们的简历数据库找到您的简历，并可查看您简历的详细内容。</p>
                <p>3.2 职位发布：如用户为招聘主体的，我们根据用户的招聘要求在上工街的职位发布栏位将招聘要求进行发布，以供求职用户查看。</p>
                <p>3.3 即时通讯：如用工企业查看到您的简历后期望与您做进一步交流时，用工企业可通过我们提供的在线即时通读功能与您交流与求职相关的内容。</p>
                <p>3.4 线上商城：本公司为用户提供在线上商城服务，用户可在线上商城浏览相关商品或服务，自主选择购买。</p>
                <p>3.5 贷款推荐：本公司在上工街中为合作的银行、消费金融公司、小额贷款公司等持牌机构发布广告，如用户需要贷款的，可自主选择向持牌机构贷款。本公司会要求持牌机构为用户提供优惠、适合的贷款条件，但用户需要知悉，本公司是为持牌机构做广告发布，本身并不涉及贷款业务，贷款条件、利率、费用等，以持牌机构的要求为准，本公司不对持牌机构是否贷款、贷款费用等相关贷款事项作任何承诺。用户有任何疑问或咨询，请与对应的持牌机构联络。</p>
                <p>3.6 广告发布：上工街还会为相关的商业合作方提供广告发布，本公司会要求商业合作方合法合规经营，但用户需要知悉，本公司并不提供广告所述内容的服务，本公司不对广告所述内容做任何承诺。用户有任何疑问或咨询，请与对应的广告所述内容供应商联络。</p>
                <p>3.7 其他：本公司会根据业务发展在上工街不时更新以上例明的服务及其他新增的服务，本公司会尽可能详尽的介绍服务内容及所涉及的收费标准，用户需仔细阅读相关的介绍及提示。一旦用户选择服务，将视同用户对完全接受服务内容及收费标准。</p>
              </div>
            </div>
            <div className="mt p_txt">
              <h5>四、账户安全及管理</h5>
              <p>4.1 用户有责任确保账户、密码、手势的机密安全。用户将对利用该账户及密码所进行的一切行动及言论，负完全的责任，并同意以下事项：</p>
              <p> 1）用户不得对其他任何人泄露账户或密码，亦不可使用其他任何人的账户或密码。因黑客、病毒或用户的保管疏忽等非本公司原因导致账号遭他人非法使用的，本公司不承担任何责任。</p>
              <p> 2）用户的账号及密码是识别用户的指令，用户确认，使用账号和密码登录后在上工街的一切行为均代表用户本人。用户的上工街账户操作所产生的电子信息记录均为用户本人行为的有效凭据，用户本人应对这些行为承担相应的法律责任。</p>
              <p> 3）冒用他人账户及密码的，本公司保留追究实际使用人连带责任的权利。</p>
              <p>4.2 用户如发现第三人未经合法授权的情形冒用或盗用本人账户及密码，应立即以有效方式通知本公司并要求暂停相关服务，否则由此产生的一切责任由用户本人承担。同时，用户理解本公司对用户的请求采取行动需要合理期限，在此之前，本公司对第三人使用该服务所导致的损失不承担任何责任。</p>
              <p>4.3 用户决定不再使用上工街账户时，应首先结清对本公司的应付款项，并向本公司申请关闭该账户，经本公司审核同意后可正式关闭账户。用户同意：一旦申请关闭账户后将会导致用户数据删除，关闭账户后，本公司将无法再为用户提供数据查询服务。</p>
              <p>4.4 用户死亡或被宣告死亡的，其在本协议项下的各项权利义务由其继承人承担。若用户丧失全部或部分民事权利能力或民事行为能力，其在本协议项下的各项权利义务由其监护人代为行使。</p>
              <p>4.5 用户同意，基于运行和交易安全的需要，本公司可以暂时中止、限制、新增、改变上工街的全部或部分功能。在任何功能减少、增加或者变化时，只要用户仍然使用上工街，表示仍然同意本协议或者变更后的协议。</p>
              <p>4.6 本公司有权基于单方独立判断，在认为可能发生安全风险情形时，无需进行事先通知即有权中止提供用户服务；在安全风险确认后，本公司有权立即暂停、关闭用户账户，且无需对用户或任何第三方承担任何责任。前述情形包括但不限于：</p>
              <p> 1）用户提供的个人资料不具有真实性、有效性或完整性；</p>
              <p> 2）发现用户行为有违法之虞时；</p>
              <p> 3）用户账户涉嫌洗钱、传销、被冒用或其他有风险之情形；</p>
              <p> 4）用户已经违反本协议中约定的；</p>
              <p> 5）用户在使用上工街收费服务时未按规定支付相应的服务费用。</p>
              <p>4.7 用户同意，账户的暂停、中止或终止不代表用户责任的终止，用户仍应对使用上工街服务期间的行为承担可能的违约或损害赔偿责任，同时本公司仍可保有用户的相关信息。</p>
            </div>
            <div className="mt p_txt">
              <h5>五、用户信息与隐私保护</h5>
              <p>5.1 本公司对用户信息予以严格保密，严格依据相关法律法规及政策之规定收集、保存、使用、共享、转让、披露及保护用户信息。</p>
              <p>5.2 更多关于用户信息与隐私保护的内容，请查看上工街隐私政策。</p>
            </div>
            <div className="mt p_txt">
              <h5>六、涉及第三方网站或客户端</h5>
              <p>6.1 上工街的内容可能涉及由第三方所有、控制或运营的其它网站或客户端，含有访问第三方网站或客户端的链接，本公司会尽力要求第三方所提供的服务合法合规，给用户提供多样化且优惠的服务，但本公司无法保证第三方网站或客户端上信息的真实性和有效性。</p>
              <p>6.2 上工街对所有第三方网站或客户端的隐私保护措施不承担任何责任。</p>
              <p>6.3 用户在使用第三方网站或客户端时，应遵守第三方网站或客户端的相关协议及使用规则。用户根据自身情况选择使用第三方服务，如有疑问或纠纷，须与第三方进行沟通解决，本公司不承担任何责任。</p>
              <p>6.4 用户通过第三方网站或客户端时（下称“第三方平台”）注册、登陆、使用上工街服务的，将被视为用户完全了解、同意第三方平台将用户在第三方平台上填写、登记、公布、记录的全部信息（下称“第三方平台记录信息”）授权上工街使用（使用方式包括但不限于收集、统计、分析等）。</p>
            </div>
            <div className="mt p_txt">
              <h5>七、违约责任</h5>
              <p>7.1 当用户的行为涉嫌违反法律法规或违反本协议约定的，本公司有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息，中止或终止提供服务，中止或终止用户账户。如使本公司遭受任何损失的（包括但不限于受到第三方的索赔、受到行政管理部门的处罚等），用户还应当赔偿或补偿本公司遭受的损失及（或）发生的费用，包括调查取证费、诉讼费、律师费、差旅费等费用。</p>
              <p>7.2 由于用户违反本协议，或违反其在上工街上签订的其它协议或文件，或由于用户使用上工街服务违反了任何法律或侵害第三方权利而导致任何第三方向本公司提出任何赔偿要求（包括律师费用），用户应对本公司给予全额补偿。</p>
            </div>
            <div className="mt p_txt">
              <h5>八、免责条款</h5>
              <p>8.1 本公司及上工街对所提供的服务将尽力维护其安全性及方便性，但由于互联网服务的特殊性，非本公司主观过错或重大过失，本公司及上工街对服务中出现的中断、信息删除或储存失败等，不承担任何责任。</p>
              <p>8.2 用户同意，基于互联网的特殊性，本公司不保证上工街服务不会中断，也不保证服务的及时性和/或安全性。若因系统相关状况无法正常运作，使用户无法使用任何上工街服务或使用任何上工街服务时受到任何影响时，本公司对用户或第三方不负任何责任，前述状况包括但不限于：</p>
              <p> 1）上工街系统停机维护期间</p>
              <p> 2）电信设备出现故障不能进行数据传输的。</p>
              <p> 3）由于黑客攻击、网络供应商技术调整或故障、网站升级、银行方面的问题等原因而造成的上工街服务中断或延迟。</p>
              <p> 4）因政府行为、台风、地震、海啸、洪水、停电、战争、恐怖袭击、网络故障等不可抗力之因素，造成上工街系统障碍不能提供服务的。不可抗力可能导致上工街无法访问、访问速度缓慢、存储数据丢失、用户个人信息泄漏等不利后果。在遭受不可抗力事件时，我们可中止履行本用户协议项下的义务直至不可抗力的影响消除为止，并且不因此承担违约责任；但应尽最大努力克服该事件，减轻其负面影响</p>
              <p>8.3 因用户的过错导致的任何损失，该过错包括但不限于：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、用户使用的操作系统被第三方侵入、用户委托他人代理操作而造成的损失。</p>
              <p>8.4 在任何情况下，用户使用上工街服务过程中涉及由上工街的合作方或第三方提供相关服务的，服务内容由该合作方或第三方负责。用户享用相关服务时产生的争议、纠纷及损失，本公司不承担任何责任。</p>
              <p>8.5 对于其他用户上传的照片、资料、证件等，上工街已采用合理措施进行审核，但无法保证其内容的正确性、合法性或可靠性，如给用户造成损失的，用户应向侵权方或违约方主张相关责任，用户同意本公司不承担任何责任。</p>
              <p>8.6 用户应以自己的独立判断从事与招聘/应聘/职场社交相关的行为，并独立承担可能产生的不利后果和责任，用户同意本公司不承担任何责任</p>
              <p>8.7 用户在使用即时通讯服务时，虽然本公司会尽合理努力按照国家有关规定按关键字进行审查，但无法完全控制通讯内容，亦无法保证内容的正确性、完整性或品质。因此用户在使用即时通讯服务时，可能会接触到令您不适、不喜的内容。在任何情况下，用户同意我们对此不需承担责任。您在接触到令您不适或令您厌恶的内容时，您可向我们举报，我们查证属实且该内容违反法律规定的，我们会对此部分内容依法做出处理。</p>
              <p>8.8 用户接收、下载其他用户提供的资料、文件时，需自行考虑并自负风险，因任何资料、文件的下载而导致的用户终端系统的任何损坏或数据丢失等后果，用户同意我们对此不需承担责任。</p>
              <p>8.9 对于我们策划、发起、组织的任何招聘相关的活动（无论线上线下或是否收费），我们无法对招聘、求职效果向用户作出任何保证或承诺，也无法保证活动期间用户自身行为的合法性、合理性。用户本人所遭受的损失或来自第三方的人身、财产、名誉损害，应由侵权方承担责任，用户同意我们对此不需承担责任。</p>
            </div>
            <div className="mt p_txt">
              <h5>九、知识产权</h5>
              <p>9.1 本公司对上工街内所有内容享有知识产权（包括但不限于商标权、专利权、著作权、商业秘密等），上工街所有内容，包括但不限于图片、档案、资讯、资料、平台架构、平台画面的安排、网页设计等，非经本公司书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表上工街程序或内容。</p>
              <p>9.2 非经本公司授权同意及法律规定，不得使用属于上工街上述所有内容。上工街所有的产品、技术及程序等信息内容均由本公司享有知识产权或被授权使用；未经本公司授权许可，任何其他组织或个人不得擅自使用（包括但不限于复制、复印、仿造、出售、转售、访问、或以其他方式加以利用等）。否则，本公司将依法追究其法律责任。</p>
              <p>9.3 用户承诺必须依法尊重本公司的知识产权，否则，本公司有权立即终止向用户提供服务，并依法追究其法律责任，要求用户赔偿本公司一切损失。</p>
              <p>9.4 用户在上工街上传或张贴的内容（包括照片、文字、录音、视频等），视为用户授予上工街在中华人民共和国境内免费、非独家的使用权，我们有权为展示、传播及推广前述张贴内容的目的，对上述内容进行复制、修改、编撰、出版等，我们在对外展示、提供时会对用户相关信息做脱敏处理。用户有权通知我们取消授权，取消授权不可追溯授权前已发生的使用行为。</p>
            </div>
            <div className="mt">
              <h5>十、通知及送达</h5>
              <p>本协议项下的通知如以公示方式作出，一经在上工街公示即视为已经送达。除此之外，其他向用户发布的具有专属性的通知将由上工街向用户注册时或注册后向上工街提供的电子邮箱、手机号码发送，一经发送即视为已经送达。请您密切关注电子邮箱中的邮件和信息及手机中的短信信息。</p>
            </div>
            <div className="mt p_txt">
              <h5>十一、法律适用和争议解决</h5>
              <p>11.1 本协议的订立、变更、执行和解释，以及与本协议有关的争议解决，均应适用中华人民共和国法律。如与本协议有关的某一特定事项没有法律规定或规定不明确，则应参照通用的商业惯例和行业惯例处理。</p>
              <p>11.2 如因本协议或因上工街服务所引起或与其有关的任何争议，如协商不成，应向本公司所在地有管辖权的法院起诉。争议期间，各方仍应继续履行本协议未涉争议的条款义务。</p>
            </div>
            <div className="mt p_txt">
              <h5>十二、其他</h5>
              <p>12.1 本协议自用户同意勾选并成功注册成为上工街用户之日起生效，除非本公司终止本协议或者用户丧失上工街用户资格，否则本协议始终有效。本协议终止并不免除用户根据本协议或其他有关协议、规则所应承担的义务和责任。</p>
              <p>12.2 本协议部分条款被认定为无效时，不影响本协议其他条款的效力。</p>
              <p>12.3 本协议版本于2020年11月5日发布</p>
              <p>12.4 本公司对本协议在法律规定的范围内享有最终的解释权。</p>
            </div>
          </section>
        </Layout>
      </div>
    );
  }
}

export default RegisterProtocol;
